In [1]:
import pandas as pd

In [2]:
# reading the csv file
df = pd.read_csv('StudentsPerformance.csv')
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

# Selecting one column

## Syntax 1

In [5]:
# select a column with [] (preferred way to select a column)
df['gender']

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [6]:
# check out the data type of a column
type(df['gender'])

pandas.core.series.Series

In [13]:
# series: attributes and methods
#df['gender'].index
df['math score'].head(15)

0     72
1     69
2     90
3     47
4     76
5     71
6     88
7     40
8     64
9     38
10    58
11    40
12    65
13    78
14    50
Name: math score, dtype: int64

## Syntax 2

In [12]:
# select a column with .
df.math score

SyntaxError: invalid syntax (1331937411.py, line 2)

In [16]:
df.columns

SyntaxError: invalid syntax (2784516738.py, line 1)

In [14]:
# select a column with . (pitfalls)
df.parental level of education

SyntaxError: invalid syntax (335221752.py, line 2)

In [15]:
# select the same column using []
df["parental level of education"]

0       bachelor's degree
1            some college
2         master's degree
3      associate's degree
4            some college
              ...
995       master's degree
996           high school
997           high school
998          some college
999          some college
Name: parental level of education, Length: 1000, dtype: object